-- MySQL dump 10.13  Distrib 8.0.33, for Win64 (x86_64)
--
-- Host: 211.22.182.205    Database: stock
-- ------------------------------------------------------
-- Server version	8.0.33

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `warehouse_group`
--

DROP TABLE IF EXISTS `warehouse_group`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `warehouse_group` (
  `GroupId` varchar(100) NOT NULL,
  `GroupName` varchar(45) DEFAULT NULL COMMENT '群組名稱',
  `GroupDescription` varchar(100) DEFAULT NULL COMMENT '群組描述',
  `IsActive` tinyint(1) NOT NULL DEFAULT '1' COMMENT '是否激活狀態',
  `CompId` varchar(100) NOT NULL COMMENT '屬於庫存系統裡面的哪一個組織所有',
  `CreatedAt` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `UpdatedAt` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`GroupId`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='主要是用來設定「人員」及「品項」可以分類為哪些組別來使用的，在新增品項和新增人員的時候，都可以從下拉選單中，選擇已建立的組別來加以管理。';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `warehouse_group`
--

LOCK TABLES `warehouse_group` WRITE;
/*!40000 ALTER TABLE `warehouse_group` DISABLE KEYS */;
INSERT INTO `warehouse_group` VALUES ('023c7077-da3f-4f92-bf77-cd532befa0b6','護理站','彰化5B病房',1,'d16f8149-4a39-4de7-9c29-869bb85b2080','2024-05-06 13:29:53','2024-05-06 13:29:53'),('03d24bae-c6d3-4a5d-84e8-82065acb79e8','護理站','南投21W病房',1,'5931f510-a1d7-4825-a581-322a25e30d97','2024-05-06 13:29:53','2024-05-06 13:29:53'),('04b9b4a6-3fee-4432-85b4-30b07c78b599','護理站','彰化開刀房',1,'99234bab-1674-4b55-b890-d5ad1879f8a8','2024-05-06 13:29:53','2024-05-06 13:29:53'),('0a7c7016-1070-42ea-a5d8-ea87d0fb231d','護理站','南投內科',1,'f9edcb14-e68b-4f13-8d45-09bf8ac24e59','2024-05-06 13:29:53','2024-05-06 13:29:53'),('0a9d9178-3661-44a5-97ca-ed5abd11a565','護理站','彰化牙科',1,'e67b64e3-28cd-491f-91a7-cb98edafb6a1','2024-05-06 13:29:53','2024-05-06 13:29:53'),('0b13ea4a-6949-41aa-bf0c-3b4e0893eff2','護理站','南投5樓ICU病房',1,'b9066a59-6d3a-4afc-8e39-c1fb42ae4888','2024-05-06 13:29:53','2024-05-06 13:29:53'),('10b49e21-efc0-46cf-ad12-afc7f2da8daa','護理站','彰化6A病房',1,'9744b1b3-c974-4f58-9737-a683b4da92a1','2024-05-06 13:29:53','2024-05-06 13:29:53'),('1d79fd16-e01f-4612-91ab-a6453c253f09','護理站','彰化1樓ICU',1,'ebc59f28-eae7-44ff-bba2-ee9ac993e701','2024-05-06 13:29:53','2024-05-06 13:29:53'),('25497d82-5ddf-4c6f-9c9b-e03a15ad30e3','血清免疫檢驗','彰化醫院檢驗科',1,'68c05e1d-c6f5-498a-8359-d961359e5875','2024-05-06 13:29:53','2024-05-06 13:29:53'),('25f9a838-503b-4b93-9975-fe8e3ad324d1','金萬林台中庫房','金萬林',1,'63c0dbc4-fdca-47e8-b084-5880fb596de2','2024-05-06 13:29:52','2024-05-06 13:29:52'),('25f9a838-503b-4b93-9975-fe8e3ad324d2','金萬林群組2','金萬林',1,'63c0dbc4-fdca-47e8-b084-5880fb596de2','2024-05-06 13:29:52','2024-05-06 13:29:52'),('2a0312ff-f148-4575-878d-75e7bfec102f','護理站','彰化身心整合病房',1,'68c3aaac-ca31-4aa4-8f2c-a38e6cd11fcb','2024-05-06 13:29:53','2024-05-06 13:29:53'),('343103c1-2f8f-4279-9802-fa2ab203e487','護理站','彰化肺功能室',1,'82a9e120-2f41-4306-b59b-cfb0995e26cf','2024-05-06 13:29:53','2024-05-06 13:29:53'),('3e43c2a3-4bd9-4ddf-9ef1-58e3275dbf11','血液檢驗','彰化醫院檢驗科',1,'68c05e1d-c6f5-498a-8359-d961359e5875','2024-05-06 13:29:53','2024-05-06 13:29:53'),('438f47b4-0650-4f60-9085-fa346904e244','護理站','南投急診',1,'c27e4287-6fa4-4595-ab9b-169de41fe09c','2024-05-06 13:29:53','2024-05-06 13:29:53'),('48a94e37-25bc-4526-af7c-2b0eeca28eb3','檢驗科-血液組','南投檢驗科',1,'894364a3-4a13-4f15-9d9c-f455dad30094','2024-05-06 13:29:53','2024-05-06 13:29:53'),('4c9a619c-2d07-4db2-b83d-df5aa1f2632f','護理站','彰化胃鏡室',1,'e16fbcfa-eb87-41c4-81e2-a442c229ce9b','2024-05-06 13:29:53','2024-05-06 13:29:53'),('512dd595-9b42-4660-8a2b-cfd0b6d9ff90','護理站','彰化2樓ICU',1,'c71faa4e-d872-4eb8-8860-9648b4bad41a','2024-05-06 13:29:53','2024-05-06 13:29:53'),('53146d19-68e1-4c1d-92cd-fd0fc7124ebd','護理站','彰化8A病房',1,'4fd956d8-c876-4f50-8526-1e38d1c1cb92','2024-05-06 13:29:53','2024-05-06 13:29:53'),('5caa3126-301c-49dd-8def-c79d10862708','護理站','彰化7B病房',1,'177f0bbc-623e-460a-960a-0a2054c070a8','2024-05-06 13:29:53','2024-05-06 13:29:53'),('5cb0d0a7-e1de-475e-9d61-548273f8d2cf','護理站','彰化6C病房',1,'85172964-61da-43f5-a822-898c387b100e','2024-05-06 13:29:53','2024-05-06 13:29:53'),('6299dd74-e792-4e78-92c2-6391ae29dd72','護理站','南投61W病房',1,'47a82751-da83-42dc-8519-56365825ce03','2024-05-06 13:29:53','2024-05-06 13:29:53'),('634a4905-acf8-4368-a487-f03e2e098445','護理站','彰化3C病房',1,'848acd80-a39d-4754-803a-3f1f3ac3f8e5','2024-05-06 13:29:53','2024-05-06 13:29:53'),('638fcf99-9377-4d6a-ae6f-cc3a26913cb5','護理站','彰化洗腎室',1,'40d85630-e124-4c85-bf5b-c34c8b52ee1d','2024-05-06 13:29:53','2024-05-06 13:29:53'),('667ec2ef-6143-4a20-a536-a2c183b744b2','護理站','彰化7C病房',1,'4d2bcd0a-14f5-4970-ab9d-d33f3b1c4b9e','2024-05-06 13:29:53','2024-05-06 13:29:53'),('6ba38376-083a-4f10-81ed-c2e3b5a3cfdc','檢驗科-血液組','草屯療養院',1,'49b98d1b-6df5-4d1d-9250-ba82b0fe2fa0','2024-05-06 13:29:53','2024-05-06 13:29:53'),('6bf47d86-ebb7-4941-bd01-b4f4a077352b','護理站','南投洗腎室',1,'675dd6dc-0be2-4fa6-8740-58d26b8016a7','2024-05-06 13:29:53','2024-05-06 13:29:53'),('6c1e9c40-b995-4e0e-aa16-436194e5912b','檢驗科-門檢組','草屯療養院',1,'49b98d1b-6df5-4d1d-9250-ba82b0fe2fa0','2024-05-06 13:29:53','2024-05-06 13:29:53'),('70b3f64a-3715-4a8c-9b45-523de1d98846','護理站','彰化8C病房',1,'fa17486a-e545-4327-80e7-d1d48effe82b','2024-05-06 13:29:53','2024-05-06 13:29:53'),('7a91425e-acba-415c-8d71-459952000f87','檢驗科-生化組','南投檢驗科',1,'894364a3-4a13-4f15-9d9c-f455dad30094','2024-05-06 13:29:52','2024-05-06 13:29:52'),('7a92c1c6-81f8-4ddb-b300-d16b818816c2','結核分生檢驗(中央)','彰化醫院檢驗科',1,'68c05e1d-c6f5-498a-8359-d961359e5875','2024-05-06 13:29:53','2024-05-06 13:29:53'),('7d8f60e2-c453-48eb-8bab-8ed28ade5710','護理站','彰化公關室',1,'431b1c87-f1b2-4ff3-98f2-0c6bb29f4d75','2024-05-06 13:29:53','2024-05-06 13:29:53'),('834f53ee-ef26-4c77-86d6-c337a3873542','護理站','彰化呼吸照護中心(RCC)',1,'a406712e-d538-4a47-ba4b-33682e4dde91','2024-05-06 13:29:53','2024-05-06 13:29:53'),('83cc2827-f908-40d4-ae28-4c66b830cce3','庫管(中央庫房)','彰化醫院檢驗科',1,'68c05e1d-c6f5-498a-8359-d961359e5875','2024-05-06 13:29:53','2024-05-06 13:29:53'),('87a58f77-7895-4a7b-a0b2-3a71ab432de3','護理站','彰化健康管理中心',1,'e0abc025-f2e7-4278-8107-c415d150643d','2024-05-06 13:29:53','2024-05-06 13:29:53'),('8ec0fcd3-f4e9-4d6c-a9c9-283a03f4559d','血庫檢驗','彰化醫院檢驗科',1,'68c05e1d-c6f5-498a-8359-d961359e5875','2024-05-06 13:29:53','2024-05-06 13:29:53'),('9127c040-9c3d-45b7-ba93-c2f529b50732','護理站','南投31W病房',1,'60a98281-6689-4bd7-84eb-525dc59f78c6','2024-05-06 13:29:53','2024-05-06 13:29:53'),('9146331a-879f-4020-b1fa-1015fb0d04e2','庫管(採購)','彰化醫院檢驗科',1,'68c05e1d-c6f5-498a-8359-d961359e5875','2024-05-06 13:29:53','2024-05-06 13:29:53'),('9b8fa782-9d23-44d5-9fcf-f5e6a1983039','護理站','彰化6B病房',1,'ed007671-7ce8-44b1-a975-51992fa892ed','2024-05-06 13:29:53','2024-05-06 13:29:53'),('9f5e6796-8c3f-471e-9af7-9525c153063b','護理站','南投32W病房',1,'b5674454-60f1-4d63-9140-38084376e089','2024-05-06 13:29:53','2024-05-06 13:29:53'),('a58d0b68-fc2c-49ad-b6a2-58e9da0aa680','護理站','南投呼吸照護病房(RCW)',1,'525cdeb4-dd59-411f-bb52-5df63a8afb22','2024-05-06 13:29:53','2024-05-06 13:29:53'),('a8a9fdd1-5f80-42c1-a52a-e1cbabc4471d','生化檢驗','彰化醫院檢驗科',1,'68c05e1d-c6f5-498a-8359-d961359e5875','2024-05-06 13:29:53','2024-05-06 13:29:53'),('a8b1c616-49bd-4046-8948-4fe2836657f8','護理站','彰化5C病房',1,'125833ba-43d1-4b97-b561-78f72a8ba521','2024-05-06 13:29:53','2024-05-06 13:29:53'),('ab83f917-f89d-4f33-a4bb-b31f14b90849','護理站','南投3樓ICU病房',1,'4fd02b90-db89-4c16-a4b8-532ee999c256','2024-05-06 13:29:53','2024-05-06 13:29:53'),('ac3d6323-00fe-4e87-a697-d6bdcfb4e0ad','護理站','彰化呼吸照護病房(RCW)',1,'382a11ad-5b14-47ae-a228-bbb9486281a4','2024-05-06 13:29:53','2024-05-06 13:29:53'),('b44dc227-180a-47f6-aedb-88bba12a4add','護理站','南投51W病房',1,'051feb29-84f4-450b-b8bc-81e506c1e104','2024-05-06 13:29:53','2024-05-06 13:29:53'),('b7c8bda8-864e-424c-9ceb-27b9ffa77024','護理站','彰化5A病房',1,'0401357f-1efa-4cc1-8464-c99b37007e69','2024-05-06 13:29:53','2024-05-06 13:29:53'),('c66e067a-2570-4c28-ba52-5c72af24270a','護理站','南投開刀房',1,'9ab52f4a-9929-4778-ab16-7a3c8d77c90c','2024-05-06 13:29:53','2024-05-06 13:29:53'),('cc9d801d-75ee-4172-b9b1-a7765e616a0e','檢驗科-門檢組','南投檢驗科',1,'894364a3-4a13-4f15-9d9c-f455dad30094','2024-05-06 13:29:53','2024-05-06 13:29:53'),('ce4430ae-2dc0-45dd-8165-da70167b6039','護理站','彰化耳鼻喉科',1,'e0d9bddf-e7c2-4716-9ad2-4661f9ddfd7f','2024-05-06 13:29:53','2024-05-06 13:29:53'),('d0439993-ff53-458d-9fa4-9ac2259d6f26','門診/鏡檢檢驗','彰化醫院檢驗科',1,'68c05e1d-c6f5-498a-8359-d961359e5875','2024-05-06 13:29:53','2024-05-06 13:29:53'),('d16e32b1-4281-43ba-a06f-201866146b0b','護理站','南投婦產科',1,'0838569e-d00c-457e-ba95-54e00ec61cb5','2024-05-06 13:29:53','2024-05-06 13:29:53'),('d513d7e7-d661-49aa-b1ec-132a932030ec','分生庫管(中央庫房)','彰化醫院檢驗科',1,'68c05e1d-c6f5-498a-8359-d961359e5875','2024-05-06 13:29:53','2024-05-06 13:29:53'),('dc1bd127-bd7d-4907-908c-3f2f8bb7520f','護理站','南投52W病房',1,'29501aa7-e278-46f5-a649-fb00913dd9b2','2024-05-06 13:29:53','2024-05-06 13:29:53'),('dcb9dc72-8f74-4f9e-a996-62b34221a579','檢驗科-生化組','草屯療養院',1,'49b98d1b-6df5-4d1d-9250-ba82b0fe2fa0','2024-05-06 13:29:53','2024-05-06 13:29:53'),('e0c99098-fe50-4d56-9b0c-f7cefaacf186','護理站','彰化急診室',1,'fe69334c-6244-4df0-84fb-83df2dfef30a','2024-05-06 13:29:53','2024-05-06 13:29:53'),('eda9f312-c9c9-47e2-b47d-f36b64ff97c4','護理站','彰化放射科',1,'d3847bc5-65c9-4c9c-9948-d7f80ee5f296','2024-05-06 13:29:53','2024-05-06 13:29:53'),('f9a59fe0-c6a1-4a5d-9896-612bb9133a45','護理站','南投6樓ICU病房',1,'04f64416-4b0d-4ff5-b7fe-44d9283e93cd','2024-05-06 13:29:53','2024-05-06 13:29:53'),('fa8ffdd6-eafc-49f2-8f7f-8805268f03c0','護理站','南投外科',1,'12bd040e-fda2-4e8e-af7d-66438a9cc771','2024-05-06 13:29:53','2024-05-06 13:29:53'),('fd15d7e3-b5fa-48f2-a807-45752be477ba','護理站','彰化麻醉科',1,'ec31f714-25fc-4288-9b6b-ec0f9885fc99','2024-05-06 13:29:53','2024-05-06 13:29:53');
/*!40000 ALTER TABLE `warehouse_group` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-05-18 14:55:06
